Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F29B.tmx
Source language: en_us
Languages: zh_cn

source: Beautiful Flowers And Their Meanings
zh_cn: 美丽的鲜花及其寓意

source: Walking through the garden, I cannot help but admire the beauty that each flower beholds - their bright colors and beautiful designs will undoubtedly capture anyone's attention.
zh_cn: 我漫步花园，每一朵花所拥有的美让人情不自禁，叹服天工——花的鲜艳色彩和美丽图案无疑吸引着每个人的注意力。

source: But, while I am appreciative of their beauty, discovering what one each symbolizes, fascinates me.
zh_cn: 虽然我很欣赏花的美丽，但我更着迷于了解各种花的象征意义。

source: Here are the meanings of 12 of the most popular (and my personal favorite) flowers - some of which will truly surprise you!
zh_cn: 以下是12种最受欢迎和我个人最喜欢鲜花的含义——其中一些一定会让你大吃一惊!

source: Alstroemeria
zh_cn: 水仙百合(Alstroemeria)

source: Commonly called the Peruvian Lily or Lily of the Incas, this South American flower mainly grows in the cool, mountainous regions in the Andes.
zh_cn: 通常被称为秘鲁百合和印加百合，这种南美花主要生长在安第斯的凉爽山区。

source: It comes in a variety of colors - orange, pink, rose, purple, red, yellow, white and salmon.
zh_cn: 它有各种各样的颜色——橙色、粉色、玫红色、紫色、红色、黄色、白色和橙红色。

source: Surprisingly though, this flower has no fragrance.
zh_cn: 不过，令人惊讶的是这种花没有一点香味。

source: Meaning: This flower symbolizes friendship and devotion.
zh_cn: 寓意：这种花象征着友谊和忠诚。

source: The twists in the flower are said to represent the tribulations of friendships.
zh_cn: 花上的皱褶代表友谊的磨难。

source: Anemone
zh_cn: 海葵(Anemone)

source: Anemone, comes from Greek origin, meaning 'the wind'.
zh_cn: 海葵，来自希腊渊源，是“风”的意思。

source: It gets its name due to the wind that blows the petals open, eventually blowing the dead petals away too.
zh_cn: 其得名是因为风儿吹得花瓣开放，最终又将死去的花瓣吹走。

source: It is also used in medicine to treat cramps, menstrual problems, and emotional distress.
zh_cn: 它在医学上还被用于治疗痉挛、月经问题，和情感痛苦。

source: Meaning: On a positive note, this flower symbolizes anticipation.
zh_cn: 寓意：从积极的意味上讲，这种花象征着期待。

source: It has a dark side however, indicating a fading hope and a feeling of having been forsaken.
zh_cn: 然而，这种花还有阴暗的一面，表明希望渺茫和一种被抛弃的感觉。

source: Carnations
zh_cn: 康乃馨(Carnations)

source: Carnations are often referred to as 'Dianthus', originating from the Greek words, dios, referring to the God, Zeus, and anthos, meaning flower.
zh_cn: 康乃馨通常被归为“石竹类植物”，来自希腊字“dios”和“anthos”，前者指的是神、宙斯，后者指的是花。

source: They are therefore known as the Flowers of God.
zh_cn: 他们因此被称为上帝的花。

source: Carnations come in a variety of colors - pink, light red, dark red, white, striped, green, purple and yellow - each depicting its own meaning.
zh_cn: 康乃馨有各种各样的颜色——粉色、浅红色、深红色、白色、斑纹、绿色、紫色和黄色——每种都有其自身意义。

source: Meaning: Generally, carnations symbolize pride and beauty.
zh_cn: 寓意：一般来说，康乃馨象征着骄傲和美丽。

source: A red carnation depicts love and admiration, while a pink carnation symbolizes the love of a woman or a mother.
zh_cn: 红色康乃馨代表爱和赞美，粉色康乃馨象征着对一个女人或一个母亲的爱。

source: Purple carnations represent capriciousness and yellow carnations symbolize disdain, rejection or disappointment.
zh_cn: 紫色康乃馨代表反复无常，黄色康乃馨象征着鄙视、排斥或失望。

source: A white carnation portrays innocence and pure love, while a striped carnation conveys refusal.
zh_cn: 白色康乃馨描绘了天真和纯洁的爱，而斑纹康乃馨则表示拒绝。

source: Cherry Blossom
zh_cn: 樱花(Cherry Blossom)

source: In spring, the Cherry Blossom is undoubtedly the most remarkable tree, making it a sight to behold - its flowers are almost pure white, tinged with the palest pink, especially near the stem.
zh_cn: 在春天，樱花无疑是最引人注目的树，令人称奇——其花几乎都是纯白色，带有最淡的粉色，尤其是近茎处。

source: Meaning: The Cherry Blossom is Japan's unofficial national flower.
zh_cn: 寓意：樱花是日本的国花。

source: In Japanese culture, this flower represents the fragility and beauty of life.
zh_cn: 在日本文化中，这种花代表生命的脆弱和美丽。

source: It serves as a reminder that life is almost overwhelmingly beautiful - yet also, tragically short.
zh_cn: 它提醒人们，生活几乎无与伦比的美丽——然而，又是如此悲绝的短暂。

source: Daffodil
zh_cn: 水仙花(Daffodil)

source: This popular flower is native to the Mediterranean, Northern Africaand the Middle East.
zh_cn: 这种令人喜爱的花原产于地中海，北非和中东地区。

source: It was grown extensively by the ancient Greeks and the Romans, after which it had become a forgotten flower until the 1600s, when a group of Englishmen happened across it, bringing them in favor once again.
zh_cn: 古希腊人和罗马人广泛种植这种花，其后被遗忘，直到1600年间，一群英国人偶尔看到这种花，使其再受宠爱。

source: Meaning: Daffodils symbolize regard and chivalry.
zh_cn: 寓意：水仙花是尊宠和骑士精神的象征。

source: It is indicative of rebirth, a new beginning and eternal life.
zh_cn: 代表着重生，代表一个新的开始和永恒的生命。

source: Daffodils also symbolize unrequited love.
zh_cn: 水仙花也象征着暗恋。

source: Superstition holds that a single daffodil foretells misfortune, while a bunch indicates joy and happiness.
zh_cn: 迷信认为单独一朵水仙花预示着不幸，而一束则表示快乐和幸福。

source: Freesia
zh_cn: 小苍兰(Freesia)

source: Freesia is one of the most fragrant flowers - its perfume having a light, sweet, soap-like floral scent.
zh_cn: 小苍兰是一种最芳香的花朵——它的香气有一种淡淡的甜，类皂的花香气味。

source: It should come as no surprise, that they are often used in perfume, scented oils and baths, and other products of the like.
zh_cn: 因此，这种花常被用于香水、香薰油，沐浴以及其他类似产品也就不足为奇了。

source: Meaning: This scented flower symbolizes innocence and thoughtfulness.
zh_cn: 寓意：这种有香味的花象征着纯真和体贴。

source: Gerberas
zh_cn: 非洲菊(Gerberas)

source: Available in a vast array of colors, Gerberas, has a long vase life making it the most popular florist flowers next to only Carnations and Roses.
zh_cn: 非洲菊有各种各样的颜色，作为瓶花，它较长的花期使其成为最受欢迎的花店用花，仅次于康乃馨和玫瑰。

source: Meaning: Gerberas convey cheerfulness.
zh_cn: 寓意：非洲菊传达快乐。

source: As they belong to the Daisy family, the Gerbera assumes many of its family's properties, symbolizing innocence and purity as well as loyal love.
zh_cn: 非洲菊属于菊科，具有许多的家庭特性，象征着天真和纯洁以及忠贞的爱。

source: Gladiolus
zh_cn: 剑兰(Gladiolus)

source: Due to its sword-shaped leaves, Gladiolus is often referred to as the Sword Lily.
zh_cn: 由于剑兰长着长剑形的叶子，所以，通常被称为“剑兰”。

source: Some parts of the plant are poisonous if ingested, and among some species, handling this flower may cause skin irritation or allergic reactions.
zh_cn: 这种植物的某些部分有毒，不可食用，在有些品种中，接触这种花都会引起皮肤刺激或过敏反应。

source: Meaning: The Gladiolus symbolizes strength of character,faithfulness and honor.
zh_cn: 寓意：剑兰象征着品德、诚实和荣誉的力量。

source: It also signifies remembrance.
zh_cn: 它还带有记忆的意思。

source: Iris
zh_cn: 鸢尾花(IRIS)

source: Meaning rainbow, this wonderful garden plant is the flower of the Greek goddess Iris, who is the messenger of Love.
zh_cn: 这种美丽园林植物的含义是彩虹，是希腊彩虹女神艾丽斯的花，彩虹女神是爱的信使。

source: Meaning: Iris symbolizes eloquence.
zh_cn: 寓意：鸢尾花是口才的象征。

source: Purple Iris is symbolic of wisdom and compliments.
zh_cn: 紫色的鸢尾花代表智慧和赞美。

source: Blue, denotes faith and hope, while yellow symbolizes passion and white, purity.
zh_cn: 蓝色的表示信念和希望，黄色的象征着激情，而白色的表示纯洁。

source: Orchid
zh_cn: 兰花(Orchid)

source: It may be surprising to discover that this delicate flower belongs to the largest plant family in the world, with more than 30,000 species of orchid, each differing widely from one another - some weighing as much as a ton with huge 30-inch petals.
zh_cn: 或许人们会感到非常惊讶，这种纤弱的花属于世界上最大的植物家族，有超过3万种兰花，彼此间差异巨大——有些花重达一吨，巨大的花瓣有30英寸大。

source: Meaning: The Orchid is a symbol of exotic beauty.
zh_cn: 寓意：兰花象征异域之美。

source: It symbolizesrefinement, thoughtfulness and mature charm.
zh_cn: 它代表精致、体贴和成熟魅力。

source: It also symbolizes proud and glorious femininity.
zh_cn: 它还象征着自豪和光荣的女性气质。

source: Peonies
zh_cn: 牡丹(Peonies)

source: These large, fragrant flowers bloom in late spring and early summer and come in shades of red, white or yellow.
zh_cn: 这些大型的，馥郁的花朵绽放在春末夏初，色泽艳丽，有红色、白色或黄色。

source: They are native to Asia, Southern Europe and North America.
zh_cn: 它们原产于亚洲、南欧和北美。

source: Meaning: Peonies symbolize bashfulness and compassion.
zh_cn: 寓意：牡丹象征着羞涩和同情。

source: They denote a happy life, happy marriage, good health and prosperity.
zh_cn: 他们意味着快乐的生活、幸福的婚姻、健康和繁荣。

source: They also express indignation or shame.
zh_cn: 它们也表达愤慨和耻辱。

source: Sunflower
zh_cn: 向日葵(Sunflower)

source: This flower is notable for turning to face the sun - a behavior known as heliotropism.
zh_cn: 这种花的最大特色是围着太阳转——这种行为被称为趋日性。

source: It can at times grow as large as a meter in diameter - the tallest ever grown measured 25 feet 5 and a 1/2 inches.
zh_cn: 向日葵有时可以长到直径一米大——有史以来最高的长到25英尺5又1/2英寸。

source: Meaning: Sunflower signifies pure thoughts.
zh_cn: 寓意：向日葵意味着纯净思维。

source: It depicts adoration and dedication.
zh_cn: 它代表崇拜和奉献。

source: It is also symbolic of dedicated love.
zh_cn: 这也象征爱情专一。
